fonecmid-diplom-main/fonecmid-diplom-main/diplom-src/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom-main/fonecmid-diplom-main/diplom-src/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom-main/fonecmid-diplom-main/diplom-src/src/Documents/ВКМ_ВыплатаЗарплаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Автозаполнить(Команда)
	АвтозаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура АвтозаполнитьНаСервере()
	
	МассивСотрудников = Новый Массив;
	Для Каждого Строка Из Объект.Выплаты Цикл
		МассивСотрудников.Добавить(Строка.Сотрудник);	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&МоментВремени, Сотрудник В (&Массив)) КАК
		|		ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	Запрос.УстановитьПараметр("МоментВремени", Объект.Дата);
	Запрос.УстановитьПараметр("Массив", МассивСотрудников);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого Строка Из Объект.Выплаты Цикл
		Если Выборка.НайтиСледующий(Новый Структура("Сотрудник", Строка.Сотрудник)) Тогда
			Строка.Сумма = Выборка.СуммаОстаток;			
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
